benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/stable-logs/no-tracing-benchmark-4000.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  5 threads and 900 connections
  Thread calibration: mean lat.: 1.091ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.022ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.101ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.012ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.028ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.94ms  636.58us   1.54ms   99.09%
    Req/Sec   848.45    302.40     1.60k    71.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    0.95ms
 90.000%    1.05ms
 99.000%    1.54ms
 99.900%   13.69ms
 99.990%   18.29ms
 99.999%   19.68ms
100.000%   21.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.667     0.000000            1         1.00
       0.780     0.100000        20075         1.11
       0.806     0.200000        40104         1.25
       0.828     0.300000        59956         1.43
       0.850     0.400000        80847         1.67
       0.872     0.500000       100338         2.00
       0.884     0.550000       110160         2.22
       0.897     0.600000       119921         2.50
       0.912     0.650000       129911         2.86
       0.929     0.700000       139843         3.33
       0.950     0.750000       149882         4.00
       0.962     0.775000       154979         4.44
       0.975     0.800000       159857         5.00
       0.990     0.825000       164927         5.71
       1.007     0.850000       169937         6.67
       1.027     0.875000       174797         8.00
       1.040     0.887500       177417         8.89
       1.054     0.900000       179914        10.00
       1.071     0.912500       182377        11.43
       1.091     0.925000       184868        13.33
       1.117     0.937500       187345        16.00
       1.133     0.943750       188588        17.78
       1.150     0.950000       189782        20.00
       1.171     0.956250       191044        22.86
       1.198     0.962500       192305        26.67
       1.232     0.968750       193532        32.00
       1.253     0.971875       194148        35.56
       1.278     0.975000       194786        40.00
       1.309     0.978125       195404        45.71
       1.350     0.981250       196029        53.33
       1.405     0.984375       196642        64.00
       1.436     0.985938       196956        71.11
       1.471     0.987500       197271        80.00
       1.510     0.989062       197586        91.43
       1.562     0.990625       197891       106.67
       1.633     0.992188       198204       128.00
       1.692     0.992969       198360       142.22
       1.777     0.993750       198515       160.00
       1.912     0.994531       198671       182.86
       2.241     0.995313       198827       213.33
       2.993     0.996094       198983       256.00
       3.615     0.996484       199061       284.44
       5.003     0.996875       199139       320.00
       6.155     0.997266       199217       365.71
       7.559     0.997656       199295       426.67
       8.751     0.998047       199373       512.00
       9.567     0.998242       199412       568.89
      10.543     0.998437       199451       640.00
      11.775     0.998633       199490       731.43
      12.735     0.998828       199529       853.33
      13.775     0.999023       199568      1024.00
      14.431     0.999121       199588      1137.78
      14.759     0.999219       199607      1280.00
      15.271     0.999316       199627      1462.86
      15.631     0.999414       199646      1706.67
      16.135     0.999512       199666      2048.00
      16.311     0.999561       199676      2275.56
      16.431     0.999609       199685      2560.00
      16.703     0.999658       199695      2925.71
      16.943     0.999707       199706      3413.33
      17.343     0.999756       199715      4096.00
      17.503     0.999780       199720      4551.11
      17.631     0.999805       199724      5120.00
      17.919     0.999829       199729      5851.43
      18.111     0.999854       199734      6826.67
      18.239     0.999878       199740      8192.00
      18.271     0.999890       199742      9102.22
      18.319     0.999902       199744     10240.00
      18.463     0.999915       199747     11702.86
      18.623     0.999927       199749     13653.33
      18.655     0.999939       199752     16384.00
      18.783     0.999945       199753     18204.44
      18.815     0.999951       199754     20480.00
      18.927     0.999957       199755     23405.71
      19.087     0.999963       199756     27306.67
      19.103     0.999969       199758     32768.00
      19.103     0.999973       199758     36408.89
      19.263     0.999976       199759     40960.00
      19.263     0.999979       199759     46811.43
      19.327     0.999982       199760     54613.33
      19.327     0.999985       199760     65536.00
      19.679     0.999986       199761     72817.78
      19.679     0.999988       199761     81920.00
      19.679     0.999989       199761     93622.86
      21.391     0.999991       199762    109226.67
      21.391     0.999992       199762    131072.00
      21.391     0.999993       199762    145635.56
      21.391     0.999994       199762    163840.00
      21.391     0.999995       199762    187245.71
      21.455     0.999995       199763    218453.33
      21.455     1.000000       199763          inf
#[Mean    =        0.937, StdDeviation   =        0.637]
#[Max     =       21.440, Total count    =       199763]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  236229 requests in 1.00m, 44.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:   3937.92
Transfer/sec:    765.28KB